In [79]:
# ATIVIDADE PROJETO INTEGRADOR

In [ ]:
# Imagine-se um(a) promissor(a) cientista de dados júnior de uma empresa de mídia que trabalha com análise de dados da área do esporte. Pois, o arquiteto de dados lhe agradeceu pelo bom serviço 
# prestado na criação das bases, já que o DBM faltou. Porém, lembrou-se de que não adianta ter tabelas se estas não 
# possuírem dados, não é mesmo?! Então, pediu que você procurasse uma fonte de dados na internet mesmo e a usasse para 
# povoar essas tabelas a fim de o pessoal começar a trabalhar. Portanto, acabou sobrando para você realizar tais pesquisas 
# e depois inserir manualmente os dados na tabela. Lembre-se de que os dados devem ser preenchidos corretamente nas tabelas 
# para que façam sentido.

# Para tanto, observe base da primeira atividade e busque os dados em websites com resultados de campeonatos e corridas 
# de Fórmula 1! Caso esteja com dificuldades, o seguinte link possui o registro de todos os campeonatos de F1, desde o 
# primeiro: <https://www.f1-fansite.com/pt/Resultados-f1>.

In [ ]:
#     Sua tarefa será, por meio da linguagem SQL:
#      1. fazer uso do comando Insert e popular as tabelas.
#      2. Criar uma query que selecione apenas pilotos da equipe Ferrari.
#      3. Exibir a quantidade de pilotos por ano de nascimento, ordenando-os por este aspecto de forma ascendente – do ano mais antigo ao mais recente.
#      4. Exibir o nome do piloto, o seu país de nascimento, nome da equipe, país da equipe, colocação final, nome do circuito e a data da realização da prova na Austrália – lembre-se de utilizar o mesmo DER.

In [ ]:
# DELETAR BANCO DE DADOS CASO EXISTA

In [1]:
# Deletar database
c.execute("DROP DATABASE formula1")

NameError: name 'c' is not defined

In [ ]:
# ENCERRAR COMUNICAÇÃO COM BANCO DE DADOS

In [292]:
db.close()

In [ ]:
# CONEXÃO COM O BANCO DE DADOS

In [2]:
import mysql.connector

In [3]:
# CDatabase connection
db = mysql.connector.connect(
host ="localhost",
user= "root",
passwd = "1234567",
database = "formula1")

ProgrammingError: 1045 (28000): Access denied for user 'root'@'localhost' (using password: YES)

In [82]:
# Cursor linking to DB
c = db.cursor()

In [83]:
# Open DAtabase
c.execute("USE formula1")
db.commit()

In [ ]:
# IMPORTAÇÃO DE TABELAS EXCEL PARA CRIAÇÃO DE DATAFRAMES NO PANDAS

In [84]:
import pandas as pd

In [85]:
# Criaçao tabela paises

In [86]:
df = pd.read_excel('H:\\formula1\\tb_paises.xlsx')

In [87]:
df

              PAIS  POPULACAO
0        AUSTRÁLIA    25499884
1           BAREIN     1701575
2            CHINA  1439323776
3       AZERBAIJÃO    10139177
4          ESPANHA    46754778
5           MÔNACO       39242
6           CANADÁ    37742154
7           FRANÇA    65273511
8          ÁUSTRIA     9006398
9       INGLATERRA    67886011
10        ALEMANHA    83783942
11         HUNGRIA     9660351
12         BÉLGICA    11589623
13          ITÁLIA    60461826
14       SINGAPURA     5850342
15          RÚSSIA   145934462
16           JAPÃO   126476461
17          MÉXICO   128932753
18  ESTADOS UNIDOS   331002651
19          BRASIL   211756692
20       ABU DHABI     1450000
21       FINLANDIA     5540720
22         HOLANDA    17134872
23         ESPANHA    46754778
24       TAILANDIA    69799978
25       AUSTRALIA    25499884
26       DINAMARCA     5792202
27         POLONIA    37846611

In [88]:
df.columns

Index(['PAIS', 'POPULACAO '], dtype='object')

In [89]:
dados = df.values.tolist()

In [90]:
dados

[['AUSTRÁLIA', 25499884],
 ['BAREIN', 1701575],
 ['CHINA', 1439323776],
 ['AZERBAIJÃO', 10139177],
 ['ESPANHA', 46754778],
 ['MÔNACO', 39242],
 ['CANADÁ', 37742154],
 ['FRANÇA', 65273511],
 ['ÁUSTRIA', 9006398],
 ['INGLATERRA', 67886011],
 ['ALEMANHA', 83783942],
 ['HUNGRIA', 9660351],
 ['BÉLGICA', 11589623],
 ['ITÁLIA', 60461826],
 ['SINGAPURA', 5850342],
 ['RÚSSIA', 145934462],
 ['JAPÃO', 126476461],
 ['MÉXICO', 128932753],
 ['ESTADOS UNIDOS', 331002651],
 ['BRASIL', 211756692],
 ['ABU DHABI', 1450000],
 ['FINLANDIA', 5540720],
 ['HOLANDA', 17134872],
 ['ESPANHA', 46754778],
 ['TAILANDIA', 69799978],
 ['AUSTRALIA', 25499884],
 ['DINAMARCA', 5792202],
 ['POLONIA', 37846611]]

In [92]:
c = db.cursor()
c.execute("DESCRIBE tb_pais")

for x in c:
    print(x)

('ID_PAIS', b'tinyint', 'NO', 'PRI', None, 'auto_increment')
('NM_PAIS', b'varchar(25)', 'NO', '', None, '')
('NR_POPULACAO', b'int', 'NO', '', None, '')

In [93]:
# Teste de inserção de dados
# mycursor = db.cursor()
# mycursor.execute("INSERT INTO tb_pais (NM_PAIS, NR_POPULACAO) VALUES (%s,%s)", ('AUSTRÁLIA', 25499884))
# db.commit()

In [94]:
sql = "INSERT INTO tb_pais (NM_PAIS, NR_POPULACAO) VALUES (%s,%s)"

In [95]:
c.executemany(sql,dados)
db.commit()

In [96]:
c.execute("SELECT * FROM tb_pais")

for x in c:
    print(x)

(1, 'AUSTRÁLIA', 25499884)
(2, 'BAREIN', 1701575)
(3, 'CHINA', 1439323776)
(4, 'AZERBAIJÃO', 10139177)
(5, 'ESPANHA', 46754778)
(6, 'MÔNACO', 39242)
(7, 'CANADÁ', 37742154)
(8, 'FRANÇA', 65273511)
(9, 'ÁUSTRIA', 9006398)
(10, 'INGLATERRA', 67886011)
(11, 'ALEMANHA', 83783942)
(12, 'HUNGRIA', 9660351)
(13, 'BÉLGICA', 11589623)
(14, 'ITÁLIA', 60461826)
(15, 'SINGAPURA', 5850342)
(16, 'RÚSSIA', 145934462)
(17, 'JAPÃO', 126476461)
(18, 'MÉXICO', 128932753)
(19, 'ESTADOS UNIDOS', 331002651)
(20, 'BRASIL', 211756692)
(21, 'ABU DHABI', 1450000)
(22, 'FINLANDIA', 5540720)
(23, 'HOLANDA', 17134872)
(24, 'ESPANHA', 46754778)
(25, 'TAILANDIA', 69799978)
(26, 'AUSTRALIA', 25499884)
(27, 'DINAMARCA', 5792202)
(28, 'POLONIA', 37846611)

In [97]:
# Apagar dados de tabela
# c.execute("TRUNCATE TABLE  tb_pais")

In [98]:
# Deletar database
# c.execute("DROP DATABASE formula1")

In [99]:
# Criaçao tabela circuitos

In [100]:
df1 = pd.read_excel('H:\\formula1\\tb_circuitos.xlsx')

In [101]:
df1

              CIRCUITO  EXTENSAO  ID_PAIS
0            MELBOURNE      5303        1
1               SAKHIR      5412        2
2               XANGAI      5451        3
3                 BAKU      6003        4
4            BARCELONA      4655        5
5          MONTE CARLO      3337        6
6             MONTREAL      4361        7
7          PAUL RICARD      5842        8
8            SPIELBERG      4318        9
9          SILVERSTONE      5891       10
10          HOCKENHEIM      4574       11
11         HUNGARORING      4381       12
12   SPA-FRANCORCHAMPS      7004       13
13               MONZA      5793       14
14          MARINA BAY      5063       15
15               SOCHI      5848       16
16              SUZUKA      5807       17
17  HERMANOS RODRIGUEZ      4304       18
18              AUSTIN      5513       19
19          INTERLAGOS      4309       20
20          YAS MARINA      5554       21

In [102]:
dados2 = df1.values.tolist()

In [103]:
dados2

[['MELBOURNE', 5303, 1],
 ['SAKHIR', 5412, 2],
 ['XANGAI', 5451, 3],
 ['BAKU', 6003, 4],
 ['BARCELONA', 4655, 5],
 ['MONTE CARLO', 3337, 6],
 ['MONTREAL', 4361, 7],
 ['PAUL RICARD', 5842, 8],
 ['SPIELBERG', 4318, 9],
 ['SILVERSTONE', 5891, 10],
 ['HOCKENHEIM', 4574, 11],
 ['HUNGARORING', 4381, 12],
 ['SPA-FRANCORCHAMPS', 7004, 13],
 ['MONZA', 5793, 14],
 ['MARINA BAY', 5063, 15],
 ['SOCHI', 5848, 16],
 ['SUZUKA', 5807, 17],
 ['HERMANOS RODRIGUEZ', 4304, 18],
 ['AUSTIN', 5513, 19],
 ['INTERLAGOS', 4309, 20],
 ['YAS MARINA', 5554, 21]]

In [104]:
c = db.cursor()
c.execute("DESCRIBE tb_circuito")

for x in c:
    print(x)

('ID_CIRCUITO', b'tinyint', 'NO', 'PRI', None, 'auto_increment')
('NM_CIRCUITO', b'varchar(25)', 'NO', '', None, '')
('NR_EXTENSAO', b'int', 'NO', '', None, '')
('ID_PAIS', b'tinyint', 'NO', 'MUL', None, '')

In [105]:
sqla = "INSERT INTO tb_circuito (NM_CIRCUITO, NR_EXTENSAO, ID_PAIS) VALUES (%s,%s,%s)"

In [106]:
c.executemany(sqla,dados2)
db.commit()

In [107]:
# Teste de inserção de dados
# c.execute("INSERT INTO circuito (NM_CIRCUITO, NR_EXTENSAO) VALUES (%s,%s)", ('AUSTRÁLIA', 25499884))
# db.commit()

In [108]:
c.execute("SELECT * FROM tb_circuito")

for x in c:
    print(x)

(1, 'MELBOURNE', 5303, 1)
(2, 'SAKHIR', 5412, 2)
(3, 'XANGAI', 5451, 3)
(4, 'BAKU', 6003, 4)
(5, 'BARCELONA', 4655, 5)
(6, 'MONTE CARLO', 3337, 6)
(7, 'MONTREAL', 4361, 7)
(8, 'PAUL RICARD', 5842, 8)
(9, 'SPIELBERG', 4318, 9)
(10, 'SILVERSTONE', 5891, 10)
(11, 'HOCKENHEIM', 4574, 11)
(12, 'HUNGARORING', 4381, 12)
(13, 'SPA-FRANCORCHAMPS', 7004, 13)
(14, 'MONZA', 5793, 14)
(15, 'MARINA BAY', 5063, 15)
(16, 'SOCHI', 5848, 16)
(17, 'SUZUKA', 5807, 17)
(18, 'HERMANOS RODRIGUEZ', 4304, 18)
(19, 'AUSTIN', 5513, 19)
(20, 'INTERLAGOS', 4309, 20)
(21, 'YAS MARINA', 5554, 21)

In [109]:
# Criaçao tabela equipes

In [110]:
df2 = pd.read_excel('H:\\formula1\\tb_equipe.xlsx')

In [111]:
df2

         EQUIPE  ID_Pais
0      MERCEDES       11
1       FERRARI       14
2      RED BULL       10
3       McLAREN       10
4       RENAULT        8
5    TORO ROSSO       14
6  RACING POINT       10
7    ALFA ROMEO       14
8          HAAS       19
9      WILLIAMS       10

In [112]:
dados3 = df2.values.tolist()

In [113]:
dados3

[['MERCEDES', 11],
 ['FERRARI', 14],
 ['RED BULL', 10],
 ['McLAREN', 10],
 ['RENAULT', 8],
 ['TORO ROSSO', 14],
 ['RACING POINT', 10],
 ['ALFA ROMEO', 14],
 ['HAAS', 19],
 ['WILLIAMS', 10]]

In [114]:
c = db.cursor()
c.execute("DESCRIBE tb_equipe")

for x in c:
    print(x)

('ID_EQUIPE', b'tinyint', 'NO', 'PRI', None, 'auto_increment')
('NM_EQUIPE', b'varchar(25)', 'NO', '', None, '')
('ID_PAIS', b'tinyint', 'NO', 'MUL', None, '')

In [115]:
sqlb = "INSERT INTO tb_equipe (NM_EQUIPE, ID_PAIS) VALUES (%s,%s)"

In [116]:
c.executemany(sqlb,dados3)
db.commit()

In [117]:
c.execute("SELECT * FROM tb_equipe")

for x in c:
    print(x)

(1, 'MERCEDES', 11)
(2, 'FERRARI', 14)
(3, 'RED BULL', 10)
(4, 'McLAREN', 10)
(5, 'RENAULT', 8)
(6, 'TORO ROSSO', 14)
(7, 'RACING POINT', 10)
(8, 'ALFA ROMEO', 14)
(9, 'HAAS', 19)
(10, 'WILLIAMS', 10)

In [118]:
# Criaçao tabela pilotos

In [119]:
df3 = pd.read_excel('H:\\formula1\\tb_piloto.xlsx')

In [120]:
df3

                  NOME DATA NASCIMENTO  ID_PAIS  ID_EQUIPE
0       LEWIS HAMILTON      1985-02-15       10          1
1      VALTTERI BOTTAS      1989-08-28       22          1
2       MAX VERSTAPPEN      1997-09-30       23          3
3      CHARLES LECLERC      1997-10-16        6          2
4     SEBASTIAN VETTEL      1987-07-03       11          2
5     CARLOS SAINZ JR.      1994-09-21        5          4
6         PIERRE GASLY      1996-02-07        8          3
7      ALEXANDER ALBON      1996-03-23       25          6
8     DANIEL RICCIARDO      1989-07-01        1          5
9         SERGIO PÉREZ      1990-01-26       18          7
10        LANDO NORRIS      1999-11-13       10          4
11      KIMI RAIKKONEN      1979-10-17       22          8
12     NICO HULKENBERG      1987-08-19       11          5
13        DANIIL KVYAT      1994-04-26       16          6
14        LANCE STROLL      1998-10-29        7          7
15     KEVIN MAGNUSSEN      1992-10-05       27          9
16  ANTONIO GIOVINAZZI      1993-12-14       14          8
17     ROMAIN GROSJEAN      1986-04-17        8          9
18       ROBERT KUBICA      1984-12-07       28         10
19      GEORGE RUSSELL      1998-02-15       10         10

In [121]:
# A coluna Data de Nascimento é do tipo TIMESTAMP não aceita na conversão para MYSQl, ela deve ser convertida para string antes
df3['DATA NASCIMENTO'] = df3['DATA NASCIMENTO'].astype('string')

In [122]:
dados4 = df3.values.tolist()

In [123]:
dados4

[['LEWIS HAMILTON', '1985-02-15', 10, 1],
 ['VALTTERI BOTTAS', '1989-08-28', 22, 1],
 ['MAX VERSTAPPEN', '1997-09-30', 23, 3],
 ['CHARLES LECLERC', '1997-10-16', 6, 2],
 ['SEBASTIAN VETTEL', '1987-07-03', 11, 2],
 ['CARLOS SAINZ JR.', '1994-09-21', 5, 4],
 ['PIERRE GASLY', '1996-02-07', 8, 3],
 ['ALEXANDER ALBON', '1996-03-23', 25, 6],
 ['DANIEL RICCIARDO', '1989-07-01', 1, 5],
 ['SERGIO PÉREZ', '1990-01-26', 18, 7],
 ['LANDO NORRIS', '1999-11-13', 10, 4],
 ['KIMI RAIKKONEN', '1979-10-17', 22, 8],
 ['NICO HULKENBERG', '1987-08-19', 11, 5],
 ['DANIIL KVYAT', '1994-04-26', 16, 6],
 ['LANCE STROLL', '1998-10-29', 7, 7],
 ['KEVIN MAGNUSSEN', '1992-10-05', 27, 9],
 ['ANTONIO GIOVINAZZI', '1993-12-14', 14, 8],
 ['ROMAIN GROSJEAN', '1986-04-17', 8, 9],
 ['ROBERT KUBICA', '1984-12-07', 28, 10],
 ['GEORGE RUSSELL', '1998-02-15', 10, 10]]

In [124]:
c = db.cursor()
c.execute("DESCRIBE tb_piloto")

for x in c:
    print(x)

('ID_PILOTO', b'tinyint', 'NO', 'PRI', None, 'auto_increment')
('NM_PILOTO', b'varchar(25)', 'NO', '', None, '')
('DT_NASCIMENTO', b'date', 'NO', '', None, '')
('ID_PAIS', b'tinyint', 'NO', 'MUL', None, '')
('ID_EQUIPE', b'tinyint', 'NO', 'MUL', None, '')

In [125]:
sqlc = "INSERT INTO tb_piloto (NM_PILOTO, DT_NASCIMENTO, ID_PAIS, ID_EQUIPE) VALUES (%s,%s,%s,%s)"

In [126]:
c.executemany(sqlc,dados4)
db.commit()

In [127]:
c.execute("SELECT * FROM tb_piloto")

for x in c:
    print(x)

(1, 'LEWIS HAMILTON', datetime.date(1985, 2, 15), 10, 1)
(2, 'VALTTERI BOTTAS', datetime.date(1989, 8, 28), 22, 1)
(3, 'MAX VERSTAPPEN', datetime.date(1997, 9, 30), 23, 3)
(4, 'CHARLES LECLERC', datetime.date(1997, 10, 16), 6, 2)
(5, 'SEBASTIAN VETTEL', datetime.date(1987, 7, 3), 11, 2)
(6, 'CARLOS SAINZ JR.', datetime.date(1994, 9, 21), 5, 4)
(7, 'PIERRE GASLY', datetime.date(1996, 2, 7), 8, 3)
(8, 'ALEXANDER ALBON', datetime.date(1996, 3, 23), 25, 6)
(9, 'DANIEL RICCIARDO', datetime.date(1989, 7, 1), 1, 5)
(10, 'SERGIO PÉREZ', datetime.date(1990, 1, 26), 18, 7)
(11, 'LANDO NORRIS', datetime.date(1999, 11, 13), 10, 4)
(12, 'KIMI RAIKKONEN', datetime.date(1979, 10, 17), 22, 8)
(13, 'NICO HULKENBERG', datetime.date(1987, 8, 19), 11, 5)
(14, 'DANIIL KVYAT', datetime.date(1994, 4, 26), 16, 6)
(15, 'LANCE STROLL', datetime.date(1998, 10, 29), 7, 7)
(16, 'KEVIN MAGNUSSEN', datetime.date(1992, 10, 5), 27, 9)
(17, 'ANTONIO GIOVINAZZI', datetime.date(1993, 12, 14), 14, 8)
(18, 'ROMAIN GROSJEAN', datetime.date(1986, 4, 17), 8, 9)
(19, 'ROBERT KUBICA', datetime.date(1984, 12, 7), 28, 10)
(20, 'GEORGE RUSSELL', datetime.date(1998, 2, 15), 10, 10)

In [128]:
# Criaçao tabela tb_prova

In [129]:
df4 = pd.read_excel('H:\\formula1\\tb_prova.xlsx')

In [130]:
df4

         DATA         NM_SITUACAO  ID_CIRCUITO
0  2019-03-17           MELBOURNE            1
1  1931-03-01              SAKHIR            2
2  2019-04-14              XANGAI            3
3  2019-04-28                BAKU            4
4  2019-05-12           BARCELONA            5
5  2019-05-26         MONTE CARLO            6
6  2019-06-01            MONTREAL            7
7  2019-06-01         PAUL RICARD            8
8  2019-06-01           SPIELBERG            9
9  2019-07-01         SILVERSTONE           10
10 2019-07-01          HOCKENHEIM           11
11 2019-08-01         HUNGARORING           12
12 2019-09-01   SPA-FRANCORCHAMPS           13
13 2019-09-08               MONZA           14
14 2019-09-22          MARINA BAY           15
15 2019-09-29               SOCHI           16
16 2019-10-01              SUZUKA           17
17 2019-10-01  HERMANOS RODRIGUEZ           18
18 2019-11-01              AUSTIN           19
19 2019-11-01          INTERLAGOS           20
20 2019-12-01          YAS MARINA           21

In [131]:
# A coluna Data de Nascimento é do tipo TIMESTAMP não aceita na conversão para MYSQl, ela deve ser convertida para string antes
df4['DATA'] = df4['DATA'].astype('string')

In [132]:
dados5 = df4.values.tolist()

In [133]:
dados5

[['2019-03-17', 'MELBOURNE', 1],
 ['1931-03-01', 'SAKHIR', 2],
 ['2019-04-14', 'XANGAI', 3],
 ['2019-04-28', 'BAKU', 4],
 ['2019-05-12', 'BARCELONA', 5],
 ['2019-05-26', 'MONTE CARLO', 6],
 ['2019-06-01', 'MONTREAL', 7],
 ['2019-06-01', 'PAUL RICARD', 8],
 ['2019-06-01', 'SPIELBERG', 9],
 ['2019-07-01', 'SILVERSTONE', 10],
 ['2019-07-01', 'HOCKENHEIM', 11],
 ['2019-08-01', 'HUNGARORING', 12],
 ['2019-09-01', 'SPA-FRANCORCHAMPS', 13],
 ['2019-09-08', 'MONZA', 14],
 ['2019-09-22', 'MARINA BAY', 15],
 ['2019-09-29', 'SOCHI', 16],
 ['2019-10-01', 'SUZUKA', 17],
 ['2019-10-01', 'HERMANOS RODRIGUEZ', 18],
 ['2019-11-01', 'AUSTIN', 19],
 ['2019-11-01', 'INTERLAGOS', 20],
 ['2019-12-01', 'YAS MARINA', 21]]

In [134]:
c = db.cursor()
c.execute("DESCRIBE tb_prova")

for x in c:
    print(x)

('ID_PROVA', b'tinyint', 'NO', 'PRI', None, 'auto_increment')
('DT_PROVA', b'date', 'NO', '', None, '')
('NM_SITUACAO', b'varchar(25)', 'NO', '', None, '')
('ID_CIRCUITO', b'tinyint', 'NO', 'MUL', None, '')

In [135]:
sqld = "INSERT INTO tb_prova (DT_PROVA, NM_SITUACAO, ID_CIRCUITO) VALUES (%s,%s,%s)"

In [136]:
c.executemany(sqld,dados5)
db.commit()

In [137]:
c.execute("SELECT * FROM tb_prova")

for x in c:
    print(x)

(1, datetime.date(2019, 3, 17), 'MELBOURNE', 1)
(2, datetime.date(1931, 3, 1), 'SAKHIR', 2)
(3, datetime.date(2019, 4, 14), 'XANGAI', 3)
(4, datetime.date(2019, 4, 28), 'BAKU', 4)
(5, datetime.date(2019, 5, 12), 'BARCELONA', 5)
(6, datetime.date(2019, 5, 26), 'MONTE CARLO', 6)
(7, datetime.date(2019, 6, 1), 'MONTREAL', 7)
(8, datetime.date(2019, 6, 1), 'PAUL RICARD', 8)
(9, datetime.date(2019, 6, 1), 'SPIELBERG', 9)
(10, datetime.date(2019, 7, 1), 'SILVERSTONE', 10)
(11, datetime.date(2019, 7, 1), 'HOCKENHEIM', 11)
(12, datetime.date(2019, 8, 1), 'HUNGARORING', 12)
(13, datetime.date(2019, 9, 1), 'SPA-FRANCORCHAMPS', 13)
(14, datetime.date(2019, 9, 8), 'MONZA', 14)
(15, datetime.date(2019, 9, 22), 'MARINA BAY', 15)
(16, datetime.date(2019, 9, 29), 'SOCHI', 16)
(17, datetime.date(2019, 10, 1), 'SUZUKA', 17)
(18, datetime.date(2019, 10, 1), 'HERMANOS RODRIGUEZ', 18)
(19, datetime.date(2019, 11, 1), 'AUSTIN', 19)
(20, datetime.date(2019, 11, 1), 'INTERLAGOS', 20)
(21, datetime.date(2019, 12, 1), 'YAS MARINA', 21)

In [138]:
# Criaçao tabela tb_resultado

In [139]:
df5 = pd.read_excel('H:\\formula1\\tb_resultado.xlsx')

In [140]:
df5

,ID_PROVA,ID_PILOTO,NR_TEMPO_PROVA,NR_COLOC_FINAL,NR_POSICAO_GRID,NR_MELHOR_VOLTA
0,1,1,01:25:48,2,1,18
1,1,2,01:25:27,1,2,26
2,1,3,01:25:49,3,4,15
3,1,4,01:26:25,5,5,10
4,1,5,01:25:24,4,3,12
5,1,6,02:00:00,20,18,0
6,1,7,01:25:35,11,17,0
7,1,8,01:26:16,14,13,0
8,1,9,02:00:00,19,12,0
9,1,10,01:26:15,13,10,0
10,1,11,01:26:15,12,8,0
11,1,12,01:25:33,8,9,4
12,1,13,01:25:32,7,11,6
13,1,14,01:25:35,10,15,1
14,1,15,01:25:34,9,16,2
15,1,16,01:26:24,6,7,8
16,1,17,01:26:37,15,14,0
17,1,18,02:00:00,18,6,0
18,1,19,01:26:19,17,20,0
19,1,20,01:26:17,16,19,0
20,2,1,01:34:21,1,3,25
21,2,2,01:34:24,2,4,18
22,2,3,01:34:27,4,5,12
23,2,4,01:34:27,3,1,16
24,2,5,01:34:57,5,2,10
25,2,6,02:00:00,19,7,0
26,2,7,01:35:19,8,13,4
27,2,8,01:35:23,9,12,2
28,2,9,02:00:00,18,10,0
29,2,10,01:35:24,10,14,1
30,2,11,01:35:07,6,9,8
31,2,12,01:35:08,7,8,6
32,2,13,02:00:00,17,17,0
33,2,14,01:34:22,12,15,0
34,2,15,01:34:41,14,18,0
35,2,16,01:34:23,13,6,0
36,2,17,01:35:25,11,16,0
37,2,18,02:00:00,20,11,0
38,2,19,01:34:22,16,20,0
39,2,20,01:35:21,15,19,0

In [141]:
dados6 = df5.values.tolist()

In [142]:
dados6

[[1, 1, datetime.time(1, 25, 48), 2, 1, 18],
 [1, 2, datetime.time(1, 25, 27), 1, 2, 26],
 [1, 3, datetime.time(1, 25, 49), 3, 4, 15],
 [1, 4, datetime.time(1, 26, 25), 5, 5, 10],
 [1, 5, datetime.time(1, 25, 24), 4, 3, 12],
 [1, 6, datetime.time(2, 0), 20, 18, 0],
 [1, 7, datetime.time(1, 25, 35), 11, 17, 0],
 [1, 8, datetime.time(1, 26, 16), 14, 13, 0],
 [1, 9, datetime.time(2, 0), 19, 12, 0],
 [1, 10, datetime.time(1, 26, 15), 13, 10, 0],
 [1, 11, datetime.time(1, 26, 15), 12, 8, 0],
 [1, 12, datetime.time(1, 25, 33), 8, 9, 4],
 [1, 13, datetime.time(1, 25, 32), 7, 11, 6],
 [1, 14, datetime.time(1, 25, 35), 10, 15, 1],
 [1, 15, datetime.time(1, 25, 34), 9, 16, 2],
 [1, 16, datetime.time(1, 26, 24), 6, 7, 8],
 [1, 17, datetime.time(1, 26, 37), 15, 14, 0],
 [1, 18, datetime.time(2, 0), 18, 6, 0],
 [1, 19, datetime.time(1, 26, 19), 17, 20, 0],
 [1, 20, datetime.time(1, 26, 17), 16, 19, 0],
 [2, 1, datetime.time(1, 34, 21), 1, 3, 25],
 [2, 2, datetime.time(1, 34, 24), 2, 4, 18],
 [2, 3, datetime.time(1, 34, 27), 4, 5, 12],
 [2, 4, datetime.time(1, 34, 27), 3, 1, 16],
 [2, 5, datetime.time(1, 34, 57), 5, 2, 10],
 [2, 6, datetime.time(2, 0), 19, 7, 0],
 [2, 7, datetime.time(1, 35, 19), 8, 13, 4],
 [2, 8, datetime.time(1, 35, 23), 9, 12, 2],
 [2, 9, datetime.time(2, 0), 18, 10, 0],
 [2, 10, datetime.time(1, 35, 24), 10, 14, 1],
 [2, 11, datetime.time(1, 35, 7), 6, 9, 8],
 [2, 12, datetime.time(1, 35, 8), 7, 8, 6],
 [2, 13, datetime.time(2, 0), 17, 17, 0],
 [2, 14, datetime.time(1, 34, 22), 12, 15, 0],
 [2, 15, datetime.time(1, 34, 41), 14, 18, 0],
 [2, 16, datetime.time(1, 34, 23), 13, 6, 0],
 [2, 17, datetime.time(1, 35, 25), 11, 16, 0],
 [2, 18, datetime.time(2, 0), 20, 11, 0],
 [2, 19, datetime.time(1, 34, 22), 16, 20, 0],
 [2, 20, datetime.time(1, 35, 21), 15, 19, 0]]

In [143]:
c = db.cursor()
c.execute("DESCRIBE tb_resultado")

for x in c:
    print(x)

('ID_PROVA', b'tinyint', 'NO', 'PRI', None, '')
('ID_PILOTO', b'tinyint', 'NO', 'PRI', None, '')
('NR_TEMPO_PROVA', b'time', 'NO', '', None, '')
('NR_COLOC_FINAL', b'tinyint', 'NO', '', None, '')
('NR_POSICAO_GRID', b'tinyint', 'NO', '', None, '')
('NR_MELHOR_VOLTA', b'tinyint', 'NO', '', None, '')

In [144]:
sqle = "INSERT INTO tb_resultado (ID_PROVA, ID_PILOTO, NR_TEMPO_PROVA, NR_COLOC_FINAL, NR_POSICAO_GRID, NR_MELHOR_VOLTA) VALUES (%s,%s,%s,%s,%s,%s)"

In [145]:
c.executemany(sqle,dados6)
db.commit()

In [146]:
c.execute("SELECT * FROM tb_resultado")

for x in c:
    print(x)

(1, 1, datetime.timedelta(seconds=5148), 2, 1, 18)
(1, 2, datetime.timedelta(seconds=5127), 1, 2, 26)
(1, 3, datetime.timedelta(seconds=5149), 3, 4, 15)
(1, 4, datetime.timedelta(seconds=5185), 5, 5, 10)
(1, 5, datetime.timedelta(seconds=5124), 4, 3, 12)
(1, 6, datetime.timedelta(seconds=7200), 20, 18, 0)
(1, 7, datetime.timedelta(seconds=5135), 11, 17, 0)
(1, 8, datetime.timedelta(seconds=5176), 14, 13, 0)
(1, 9, datetime.timedelta(seconds=7200), 19, 12, 0)
(1, 10, datetime.timedelta(seconds=5175), 13, 10, 0)
(1, 11, datetime.timedelta(seconds=5175), 12, 8, 0)
(1, 12, datetime.timedelta(seconds=5133), 8, 9, 4)
(1, 13, datetime.timedelta(seconds=5132), 7, 11, 6)
(1, 14, datetime.timedelta(seconds=5135), 10, 15, 1)
(1, 15, datetime.timedelta(seconds=5134), 9, 16, 2)
(1, 16, datetime.timedelta(seconds=5184), 6, 7, 8)
(1, 17, datetime.timedelta(seconds=5197), 15, 14, 0)
(1, 18, datetime.timedelta(seconds=7200), 18, 6, 0)
(1, 19, datetime.timedelta(seconds=5179), 17, 20, 0)
(1, 20, datetime.timedelta(seconds=5177), 16, 19, 0)
(2, 1, datetime.timedelta(seconds=5661), 1, 3, 25)
(2, 2, datetime.timedelta(seconds=5664), 2, 4, 18)
(2, 3, datetime.timedelta(seconds=5667), 4, 5, 12)
(2, 4, datetime.timedelta(seconds=5667), 3, 1, 16)
(2, 5, datetime.timedelta(seconds=5697), 5, 2, 10)
(2, 6, datetime.timedelta(seconds=7200), 19, 7, 0)
(2, 7, datetime.timedelta(seconds=5719), 8, 13, 4)
(2, 8, datetime.timedelta(seconds=5723), 9, 12, 2)
(2, 9, datetime.timedelta(seconds=7200), 18, 10, 0)
(2, 10, datetime.timedelta(seconds=5724), 10, 14, 1)
(2, 11, datetime.timedelta(seconds=5707), 6, 9, 8)
(2, 12, datetime.timedelta(seconds=5708), 7, 8, 6)
(2, 13, datetime.timedelta(seconds=7200), 17, 17, 0)
(2, 14, datetime.timedelta(seconds=5662), 12, 15, 0)
(2, 15, datetime.timedelta(seconds=5681), 14, 18, 0)
(2, 16, datetime.timedelta(seconds=5663), 13, 6, 0)
(2, 17, datetime.timedelta(seconds=5725), 11, 16, 0)
(2, 18, datetime.timedelta(seconds=7200), 20, 11, 0)
(2, 19, datetime.timedelta(seconds=5662), 16, 20, 0)
(2, 20, datetime.timedelta(seconds=5721), 15, 19, 0)

In [147]:
# ANALISE DOS RESULTADOS PEDIDOS

In [148]:
# Selecionar pilotos da F1
# Criar uma query que selecione apenas pilotos da equipe Ferrari.

In [149]:
c.execute("SELECT * FROM tb_piloto WHERE ID_EQUIPE = 2")

for x in c:
    print(x)

(4, 'CHARLES LECLERC', datetime.date(1997, 10, 16), 6, 2)
(5, 'SEBASTIAN VETTEL', datetime.date(1987, 7, 3), 11, 2)

In [150]:
# Exibir a quantidade de pilotos por ano de nascimento, ordenando-os por este aspecto de forma ascendente
# do ano mais antigo ao mais recente.

In [151]:
c.execute("SELECT * FROM tb_piloto ORDER BY DT_NASCIMENTO")

for x in c:
    print(x)

(12, 'KIMI RAIKKONEN', datetime.date(1979, 10, 17), 22, 8)
(19, 'ROBERT KUBICA', datetime.date(1984, 12, 7), 28, 10)
(1, 'LEWIS HAMILTON', datetime.date(1985, 2, 15), 10, 1)
(18, 'ROMAIN GROSJEAN', datetime.date(1986, 4, 17), 8, 9)
(5, 'SEBASTIAN VETTEL', datetime.date(1987, 7, 3), 11, 2)
(13, 'NICO HULKENBERG', datetime.date(1987, 8, 19), 11, 5)
(9, 'DANIEL RICCIARDO', datetime.date(1989, 7, 1), 1, 5)
(2, 'VALTTERI BOTTAS', datetime.date(1989, 8, 28), 22, 1)
(10, 'SERGIO PÉREZ', datetime.date(1990, 1, 26), 18, 7)
(16, 'KEVIN MAGNUSSEN', datetime.date(1992, 10, 5), 27, 9)
(17, 'ANTONIO GIOVINAZZI', datetime.date(1993, 12, 14), 14, 8)
(14, 'DANIIL KVYAT', datetime.date(1994, 4, 26), 16, 6)
(6, 'CARLOS SAINZ JR.', datetime.date(1994, 9, 21), 5, 4)
(7, 'PIERRE GASLY', datetime.date(1996, 2, 7), 8, 3)
(8, 'ALEXANDER ALBON', datetime.date(1996, 3, 23), 25, 6)
(3, 'MAX VERSTAPPEN', datetime.date(1997, 9, 30), 23, 3)
(4, 'CHARLES LECLERC', datetime.date(1997, 10, 16), 6, 2)
(20, 'GEORGE RUSSELL', datetime.date(1998, 2, 15), 10, 10)
(15, 'LANCE STROLL', datetime.date(1998, 10, 29), 7, 7)
(11, 'LANDO NORRIS', datetime.date(1999, 11, 13), 10, 4)

In [ ]:
# Exibir o nome do piloto, o seu país de nascimento, nome da equipe, país da equipe, colocação final, 
# nome do circuito e a data da realização da prova na Austrália

In [173]:
c.execute("SELECT p.NM_PILOTO, a.NM_PAIS, e.NM_EQUIPE, e.ID_PAIS, r.NR_COLOC_FINAL, pr.DT_PROVA, c.NM_CIRCUITO"
       "\n FROM tb_piloto p"
       "\n JOIN tb_pais a"
       "\n ON p.ID_pais = a.ID_PAIS"
       "\n JOIN tb_equipe e"
       "\n ON p.ID_EQUIPE = e.ID_EQUIPE"
       "\n JOIN tb_resultado r"
       "\n ON p.ID_PILOTO = r.ID_PILOTO"
       "\n JOIN tb_prova pr"
       "\n ON r.ID_PROVA = pr.ID_PROVA"
       "\n JOIN tb_circuito c"
       "\n ON pr.ID_CIRCUITO = C.ID_CIRCUITO"  

        "\n WHERE r.ID_PROVA = 1"
        "\n ORDER BY r.NR_COLOC_FINAL"
         )

for x in c:
    print(x)

('VALTTERI BOTTAS', 'FINLANDIA', 'MERCEDES', 11, 1, datetime.date(2019, 3, 17), 'MELBOURNE')
('LEWIS HAMILTON', 'INGLATERRA', 'MERCEDES', 11, 2, datetime.date(2019, 3, 17), 'MELBOURNE')
('MAX VERSTAPPEN', 'HOLANDA', 'RED BULL', 10, 3, datetime.date(2019, 3, 17), 'MELBOURNE')
('SEBASTIAN VETTEL', 'ALEMANHA', 'FERRARI', 14, 4, datetime.date(2019, 3, 17), 'MELBOURNE')
('CHARLES LECLERC', 'MÔNACO', 'FERRARI', 14, 5, datetime.date(2019, 3, 17), 'MELBOURNE')
('KEVIN MAGNUSSEN', 'DINAMARCA', 'HAAS', 19, 6, datetime.date(2019, 3, 17), 'MELBOURNE')
('NICO HULKENBERG', 'ALEMANHA', 'RENAULT', 8, 7, datetime.date(2019, 3, 17), 'MELBOURNE')
('KIMI RAIKKONEN', 'FINLANDIA', 'ALFA ROMEO', 14, 8, datetime.date(2019, 3, 17), 'MELBOURNE')
('LANCE STROLL', 'CANADÁ', 'RACING POINT', 10, 9, datetime.date(2019, 3, 17), 'MELBOURNE')
('DANIIL KVYAT', 'RÚSSIA', 'TORO ROSSO', 14, 10, datetime.date(2019, 3, 17), 'MELBOURNE')
('PIERRE GASLY', 'FRANÇA', 'RED BULL', 10, 11, datetime.date(2019, 3, 17), 'MELBOURNE')
('LANDO NORRIS', 'INGLATERRA', 'McLAREN', 10, 12, datetime.date(2019, 3, 17), 'MELBOURNE')
('SERGIO PÉREZ', 'MÉXICO', 'RACING POINT', 10, 13, datetime.date(2019, 3, 17), 'MELBOURNE')
('ALEXANDER ALBON', 'TAILANDIA', 'TORO ROSSO', 14, 14, datetime.date(2019, 3, 17), 'MELBOURNE')
('ANTONIO GIOVINAZZI', 'ITÁLIA', 'ALFA ROMEO', 14, 15, datetime.date(2019, 3, 17), 'MELBOURNE')
('GEORGE RUSSELL', 'INGLATERRA', 'WILLIAMS', 10, 16, datetime.date(2019, 3, 17), 'MELBOURNE')
('ROBERT KUBICA', 'POLONIA', 'WILLIAMS', 10, 17, datetime.date(2019, 3, 17), 'MELBOURNE')
('ROMAIN GROSJEAN', 'FRANÇA', 'HAAS', 19, 18, datetime.date(2019, 3, 17), 'MELBOURNE')
('DANIEL RICCIARDO', 'AUSTRÁLIA', 'RENAULT', 8, 19, datetime.date(2019, 3, 17), 'MELBOURNE')
('CARLOS SAINZ JR.', 'ESPANHA', 'McLAREN', 10, 20, datetime.date(2019, 3, 17), 'MELBOURNE')